; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image1 - mode
	thermograph2 - mode
	infrared0 - mode
	spectrograph3 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation0 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet10)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 100)
	(= (data Star5 image1) 28)
	(= (data Planet6 image1) 298)
	(= (data Star7 image1) 240)
	(= (data Star8 image1) 187)
	(= (data Star9 image1) 203)
	(= (data Planet10 image1) 126)
	(= (data Planet11 image1) 58)
	(= (data Star12 image1) 234)
	(= (data Planet13 image1) 80)
	(= (data Star14 image1) 79)
	(= (data Star5 thermograph2) 258)
	(= (data Planet6 thermograph2) 215)
	(= (data Star7 thermograph2) 282)
	(= (data Star8 thermograph2) 209)
	(= (data Star9 thermograph2) 21)
	(= (data Planet10 thermograph2) 4)
	(= (data Planet11 thermograph2) 62)
	(= (data Star12 thermograph2) 67)
	(= (data Planet13 thermograph2) 217)
	(= (data Star14 thermograph2) 165)
	(= (data Star5 infrared0) 110)
	(= (data Planet6 infrared0) 212)
	(= (data Star7 infrared0) 195)
	(= (data Star8 infrared0) 218)
	(= (data Star9 infrared0) 118)
	(= (data Planet10 infrared0) 297)
	(= (data Planet11 infrared0) 145)
	(= (data Star12 infrared0) 194)
	(= (data Planet13 infrared0) 246)
	(= (data Star14 infrared0) 54)
	(= (data Star5 spectrograph3) 214)
	(= (data Planet6 spectrograph3) 139)
	(= (data Star7 spectrograph3) 276)
	(= (data Star8 spectrograph3) 253)
	(= (data Star9 spectrograph3) 222)
	(= (data Planet10 spectrograph3) 115)
	(= (data Planet11 spectrograph3) 148)
	(= (data Star12 spectrograph3) 66)
	(= (data Planet13 spectrograph3) 219)
	(= (data Star14 spectrograph3) 99)
	(= (slew_time GroundStation1 GroundStation0) 20.83)
	(= (slew_time GroundStation0 GroundStation1) 20.83)
	(= (slew_time GroundStation2 GroundStation0) 50.73)
	(= (slew_time GroundStation0 GroundStation2) 50.73)
	(= (slew_time GroundStation2 GroundStation1) 23.8)
	(= (slew_time GroundStation1 GroundStation2) 23.8)
	(= (slew_time GroundStation3 GroundStation0) 13.18)
	(= (slew_time GroundStation0 GroundStation3) 13.18)
	(= (slew_time GroundStation3 GroundStation1) 8.919)
	(= (slew_time GroundStation1 GroundStation3) 8.919)
	(= (slew_time GroundStation3 GroundStation2) 2.647)
	(= (slew_time GroundStation2 GroundStation3) 2.647)
	(= (slew_time Star4 GroundStation0) 35.35)
	(= (slew_time GroundStation0 Star4) 35.35)
	(= (slew_time Star4 GroundStation1) 54.15)
	(= (slew_time GroundStation1 Star4) 54.15)
	(= (slew_time Star4 GroundStation2) 21.58)
	(= (slew_time GroundStation2 Star4) 21.58)
	(= (slew_time Star4 GroundStation3) 40.52)
	(= (slew_time GroundStation3 Star4) 40.52)
	(= (slew_time Star5 GroundStation0) 27.32)
	(= (slew_time GroundStation0 Star5) 27.32)
	(= (slew_time Star5 GroundStation1) 74.81)
	(= (slew_time GroundStation1 Star5) 74.81)
	(= (slew_time Star5 GroundStation2) 10.8)
	(= (slew_time GroundStation2 Star5) 10.8)
	(= (slew_time Star5 GroundStation3) 64.69)
	(= (slew_time GroundStation3 Star5) 64.69)
	(= (slew_time Star5 Star4) 43.68)
	(= (slew_time Star4 Star5) 43.68)
	(= (slew_time Planet6 GroundStation0) 36.86)
	(= (slew_time GroundStation0 Planet6) 36.86)
	(= (slew_time Planet6 GroundStation1) 39.53)
	(= (slew_time GroundStation1 Planet6) 39.53)
	(= (slew_time Planet6 GroundStation2) 23.52)
	(= (slew_time GroundStation2 Planet6) 23.52)
	(= (slew_time Planet6 GroundStation3) 29.99)
	(= (slew_time GroundStation3 Planet6) 29.99)
	(= (slew_time Planet6 Star4) 29.32)
	(= (slew_time Star4 Planet6) 29.32)
	(= (slew_time Planet6 Star5) 24.47)
	(= (slew_time Star5 Planet6) 24.47)
	(= (slew_time Star7 GroundStation0) 62.36)
	(= (slew_time GroundStation0 Star7) 62.36)
	(= (slew_time Star7 GroundStation1) 69.96)
	(= (slew_time GroundStation1 Star7) 69.96)
	(= (slew_time Star7 GroundStation2) 17.16)
	(= (slew_time GroundStation2 Star7) 17.16)
	(= (slew_time Star7 GroundStation3) 33.82)
	(= (slew_time GroundStation3 Star7) 33.82)
	(= (slew_time Star7 Star4) 3.677)
	(= (slew_time Star4 Star7) 3.677)
	(= (slew_time Star7 Star5) 37.39)
	(= (slew_time Star5 Star7) 37.39)
	(= (slew_time Star7 Planet6) 7.509)
	(= (slew_time Planet6 Star7) 7.509)
	(= (slew_time Star8 GroundStation0) 48.91)
	(= (slew_time GroundStation0 Star8) 48.91)
	(= (slew_time Star8 GroundStation1) 8.743)
	(= (slew_time GroundStation1 Star8) 8.743)
	(= (slew_time Star8 GroundStation2) 31.33)
	(= (slew_time GroundStation2 Star8) 31.33)
	(= (slew_time Star8 GroundStation3) 17.11)
	(= (slew_time GroundStation3 Star8) 17.11)
	(= (slew_time Star8 Star4) 15.85)
	(= (slew_time Star4 Star8) 15.85)
	(= (slew_time Star8 Star5) 61.78)
	(= (slew_time Star5 Star8) 61.78)
	(= (slew_time Star8 Planet6) 53.16)
	(= (slew_time Planet6 Star8) 53.16)
	(= (slew_time Star8 Star7) 66.04)
	(= (slew_time Star7 Star8) 66.04)
	(= (slew_time Star9 GroundStation0) 38.54)
	(= (slew_time GroundStation0 Star9) 38.54)
	(= (slew_time Star9 GroundStation1) 73)
	(= (slew_time GroundStation1 Star9) 73)
	(= (slew_time Star9 GroundStation2) 13.22)
	(= (slew_time GroundStation2 Star9) 13.22)
	(= (slew_time Star9 GroundStation3) 7.019)
	(= (slew_time GroundStation3 Star9) 7.019)
	(= (slew_time Star9 Star4) 20.83)
	(= (slew_time Star4 Star9) 20.83)
	(= (slew_time Star9 Star5) 27.37)
	(= (slew_time Star5 Star9) 27.37)
	(= (slew_time Star9 Planet6) 4.291)
	(= (slew_time Planet6 Star9) 4.291)
	(= (slew_time Star9 Star7) 67.11)
	(= (slew_time Star7 Star9) 67.11)
	(= (slew_time Star9 Star8) 0.7796)
	(= (slew_time Star8 Star9) 0.7796)
	(= (slew_time Planet10 GroundStation0) 77.23)
	(= (slew_time GroundStation0 Planet10) 77.23)
	(= (slew_time Planet10 GroundStation1) 35.8)
	(= (slew_time GroundStation1 Planet10) 35.8)
	(= (slew_time Planet10 GroundStation2) 29.99)
	(= (slew_time GroundStation2 Planet10) 29.99)
	(= (slew_time Planet10 GroundStation3) 8.935)
	(= (slew_time GroundStation3 Planet10) 8.935)
	(= (slew_time Planet10 Star4) 27.86)
	(= (slew_time Star4 Planet10) 27.86)
	(= (slew_time Planet10 Star5) 18.08)
	(= (slew_time Star5 Planet10) 18.08)
	(= (slew_time Planet10 Planet6) 33.59)
	(= (slew_time Planet6 Planet10) 33.59)
	(= (slew_time Planet10 Star7) 5.085)
	(= (slew_time Star7 Planet10) 5.085)
	(= (slew_time Planet10 Star8) 7.743)
	(= (slew_time Star8 Planet10) 7.743)
	(= (slew_time Planet10 Star9) 5.427)
	(= (slew_time Star9 Planet10) 5.427)
	(= (slew_time Planet11 GroundStation0) 1.352)
	(= (slew_time GroundStation0 Planet11) 1.352)
	(= (slew_time Planet11 GroundStation1) 0.4453)
	(= (slew_time GroundStation1 Planet11) 0.4453)
	(= (slew_time Planet11 GroundStation2) 39.45)
	(= (slew_time GroundStation2 Planet11) 39.45)
	(= (slew_time Planet11 GroundStation3) 32.31)
	(= (slew_time GroundStation3 Planet11) 32.31)
	(= (slew_time Planet11 Star4) 9.7)
	(= (slew_time Star4 Planet11) 9.7)
	(= (slew_time Planet11 Star5) 47.52)
	(= (slew_time Star5 Planet11) 47.52)
	(= (slew_time Planet11 Planet6) 36.96)
	(= (slew_time Planet6 Planet11) 36.96)
	(= (slew_time Planet11 Star7) 41.59)
	(= (slew_time Star7 Planet11) 41.59)
	(= (slew_time Planet11 Star8) 67.8)
	(= (slew_time Star8 Planet11) 67.8)
	(= (slew_time Planet11 Star9) 31.5)
	(= (slew_time Star9 Planet11) 31.5)
	(= (slew_time Planet11 Planet10) 27.13)
	(= (slew_time Planet10 Planet11) 27.13)
	(= (slew_time Star12 GroundStation0) 27.33)
	(= (slew_time GroundStation0 Star12) 27.33)
	(= (slew_time Star12 GroundStation1) 12.12)
	(= (slew_time GroundStation1 Star12) 12.12)
	(= (slew_time Star12 GroundStation2) 3.022)
	(= (slew_time GroundStation2 Star12) 3.022)
	(= (slew_time Star12 GroundStation3) 7.578)
	(= (slew_time GroundStation3 Star12) 7.578)
	(= (slew_time Star12 Star4) 36.8)
	(= (slew_time Star4 Star12) 36.8)
	(= (slew_time Star12 Star5) 70.53)
	(= (slew_time Star5 Star12) 70.53)
	(= (slew_time Star12 Planet6) 54.84)
	(= (slew_time Planet6 Star12) 54.84)
	(= (slew_time Star12 Star7) 59.83)
	(= (slew_time Star7 Star12) 59.83)
	(= (slew_time Star12 Star8) 21.96)
	(= (slew_time Star8 Star12) 21.96)
	(= (slew_time Star12 Star9) 76.75)
	(= (slew_time Star9 Star12) 76.75)
	(= (slew_time Star12 Planet10) 3.178)
	(= (slew_time Planet10 Star12) 3.178)
	(= (slew_time Star12 Planet11) 53.53)
	(= (slew_time Planet11 Star12) 53.53)
	(= (slew_time Planet13 GroundStation0) 71.48)
	(= (slew_time GroundStation0 Planet13) 71.48)
	(= (slew_time Planet13 GroundStation1) 41.75)
	(= (slew_time GroundStation1 Planet13) 41.75)
	(= (slew_time Planet13 GroundStation2) 15.58)
	(= (slew_time GroundStation2 Planet13) 15.58)
	(= (slew_time Planet13 GroundStation3) 54.79)
	(= (slew_time GroundStation3 Planet13) 54.79)
	(= (slew_time Planet13 Star4) 16.9)
	(= (slew_time Star4 Planet13) 16.9)
	(= (slew_time Planet13 Star5) 58.34)
	(= (slew_time Star5 Planet13) 58.34)
	(= (slew_time Planet13 Planet6) 67.2)
	(= (slew_time Planet6 Planet13) 67.2)
	(= (slew_time Planet13 Star7) 48.81)
	(= (slew_time Star7 Planet13) 48.81)
	(= (slew_time Planet13 Star8) 70.87)
	(= (slew_time Star8 Planet13) 70.87)
	(= (slew_time Planet13 Star9) 20.38)
	(= (slew_time Star9 Planet13) 20.38)
	(= (slew_time Planet13 Planet10) 22.44)
	(= (slew_time Planet10 Planet13) 22.44)
	(= (slew_time Planet13 Planet11) 14.12)
	(= (slew_time Planet11 Planet13) 14.12)
	(= (slew_time Planet13 Star12) 54.89)
	(= (slew_time Star12 Planet13) 54.89)
	(= (slew_time Star14 GroundStation0) 20.26)
	(= (slew_time GroundStation0 Star14) 20.26)
	(= (slew_time Star14 GroundStation1) 31.43)
	(= (slew_time GroundStation1 Star14) 31.43)
	(= (slew_time Star14 GroundStation2) 32.76)
	(= (slew_time GroundStation2 Star14) 32.76)
	(= (slew_time Star14 GroundStation3) 59.84)
	(= (slew_time GroundStation3 Star14) 59.84)
	(= (slew_time Star14 Star4) 10.39)
	(= (slew_time Star4 Star14) 10.39)
	(= (slew_time Star14 Star5) 10.39)
	(= (slew_time Star5 Star14) 10.39)
	(= (slew_time Star14 Planet6) 3.483)
	(= (slew_time Planet6 Star14) 3.483)
	(= (slew_time Star14 Star7) 68.75)
	(= (slew_time Star7 Star14) 68.75)
	(= (slew_time Star14 Star8) 28.18)
	(= (slew_time Star8 Star14) 28.18)
	(= (slew_time Star14 Star9) 9.297)
	(= (slew_time Star9 Star14) 9.297)
	(= (slew_time Star14 Planet10) 55.82)
	(= (slew_time Planet10 Star14) 55.82)
	(= (slew_time Star14 Planet11) 27.75)
	(= (slew_time Planet11 Star14) 27.75)
	(= (slew_time Star14 Star12) 87.11)
	(= (slew_time Star12 Star14) 87.11)
	(= (slew_time Star14 Planet13) 22.47)
	(= (slew_time Planet13 Star14) 22.47)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Star8 spectrograph3)
	(have_image Star12 spectrograph3)
	(have_image Planet13 spectrograph3)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 planet11 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet11)
   changed: (fuel satellite0) from 100 to 72.87, (fuel-used) from 0 to 27.13
   goals met: 0 of 3
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
3. (turn_to satellite0 groundstation0 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 72.87 to 71.518, (fuel-used) from 27.13 to 28.482
   goals met: 0 of 3
4. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 3
5. (turn_to satellite0 star12 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star12)
   changed: (fuel satellite0) from 71.518 to 44.188, (fuel-used) from 28.482 to 55.812
   goals met: 0 of 3
6. (take_image satellite0 star12 instrument0 spectrograph3)
   added: (have_image star12 spectrograph3)
   changed: (data_capacity satellite0) from 1000 to 934, (data-stored) from 0 to 66
   goals met: 1 of 3
7. (turn_to satellite0 star8 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 44.188 to 22.228, (fuel-used) from 55.812 to 77.772
   goals met: 1 of 3
8. (take_image satellite0 star8 instrument0 spectrograph3)
   added: (have_image star8 spectrograph3)
   changed: (data_capacity satellite0) from 934 to 681, (data-stored) from 66 to 319
   goals met: 2 of 3
9. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   changed: (fuel satellite0) from 22.228 to 21.4484, (fuel-used) from 77.772 to 78.5516
   goals met: 2 of 3
10. (turn_to satellite0 planet13 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 planet13)
   changed: (fuel satellite0) from 21.4484 to 1.0684, (fuel-used) from 78.5516 to 98.9316
   goals met: 2 of 3
11. (take_image satellite0 planet13 instrument0 spectrograph3)
   added: (have_image planet13 spectrograph3)
   changed: (data_capacity satellite0) from 681 to 462, (data-stored) from 319 to 538
   goals met: 3 of 3
